keyboard.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title></title>
<!-- 2018-03-27 Tue 20:06 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="TWO" />
</head>
<body>
<div id="content">
<h1 class="title"></h1>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left"><b>GENERAL</b></td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">C-x C-+</td>
<td class="left">zoom in</td>
</tr>

<tr>
<td class="left">C-x C--</td>
<td class="left">zoom out</td>
</tr>

<tr>
<td class="left">C-x 0</td>
<td class="left">delete active window</td>
</tr>

<tr>
<td class="left">C-x 1</td>
<td class="left">deletes other windows</td>
</tr>

<tr>
<td class="left">C-x 2</td>
<td class="left">split window below</td>
</tr>

<tr>
<td class="left">C-x 3</td>
<td class="left">split window right</td>
</tr>

<tr>
<td class="left">C-x } C-x {</td>
<td class="left">increase (decrease) buffer width</td>
</tr>

<tr>
<td class="left">C-x 4 0</td>
<td class="left">kill buffer and window</td>
</tr>

<tr>
<td class="left">C-x o</td>
<td class="left">other buffer</td>
</tr>

<tr>
<td class="left">C-x b</td>
<td class="left">switch to buffer</td>
</tr>

<tr>
<td class="left">C-x C-b</td>
<td class="left">list buffers</td>
</tr>

<tr>
<td class="left">C-x 4 b</td>
<td class="left">display a buffer in the next window</td>
</tr>

<tr>
<td class="left">C-x 4 f</td>
<td class="left">display a file in the next window</td>
</tr>

<tr>
<td class="left">C-x i</td>
<td class="left">insert file contents into buffer</td>
</tr>

<tr>
<td class="left">C-x C-c</td>
<td class="left">insert control-c into ansi-term</td>
</tr>

<tr>
<td class="left">C-x C-f</td>
<td class="left">open file</td>
</tr>

<tr>
<td class="left">C-x C-s</td>
<td class="left">save buffer</td>
</tr>

<tr>
<td class="left">C-x C-c</td>
<td class="left">exit Emacs</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left"><b>HELP</b></td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&lt;any prefix&gt; C-h</td>
<td class="left">list keys for prefix</td>
</tr>

<tr>
<td class="left">M-x apropos</td>
<td class="left">help</td>
</tr>

<tr>
<td class="left">M-x info</td>
<td class="left">manual (u = up)</td>
</tr>

<tr>
<td class="left">M-x describe-mode</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">M-x describe-function</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">M-x describe-variable</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">M-x describe-key</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left"><b>SPELLING</b></td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">M-x flyspell-mode</td>
<td class="left">highlight spelling</td>
</tr>

<tr>
<td class="left">M-x ispell-buffer</td>
<td class="left">check buffer</td>
</tr>

<tr>
<td class="left">M-$</td>
<td class="left">check work at point</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left"><b>EDITING</b></td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">C-x u</td>
<td class="left">undo</td>
</tr>

<tr>
<td class="left">C-x z</td>
<td class="left">repeat (z alone for multiple)</td>
</tr>

<tr>
<td class="left">C-g</td>
<td class="left">cancel</td>
</tr>

<tr>
<td class="left">M-m</td>
<td class="left">home but to first non-whitespace</td>
</tr>

<tr>
<td class="left">M-&lt; M-&gt;</td>
<td class="left">beginning (end) of buffer</td>
</tr>

<tr>
<td class="left">C-M-f</td>
<td class="left">forward by sexp</td>
</tr>

<tr>
<td class="left">C-M-b</td>
<td class="left">backward by sexp</td>
</tr>

<tr>
<td class="left">C-l</td>
<td class="left">center window at point</td>
</tr>

<tr>
<td class="left">M-g M-g</td>
<td class="left">go to line</td>
</tr>

<tr>
<td class="left">M-0 or C-u 0</td>
<td class="left">digit argument 0-9</td>
</tr>

<tr>
<td class="left">M&#x2013; or C--</td>
<td class="left">negative argument</td>
</tr>

<tr>
<td class="left">C-c C-&lt;down&gt;</td>
<td class="left">duplicate line</td>
</tr>

<tr>
<td class="left">C-c &lt;del&gt;</td>
<td class="left">delete line</td>
</tr>

<tr>
<td class="left">M-x bookmark-set</td>
<td class="left">sets bookmark of current open file</td>
</tr>

<tr>
<td class="left">M-x list-bookmark</td>
<td class="left">opens bookmark buffer</td>
</tr>

<tr>
<td class="left">M-x bookmark-jump</td>
<td class="left">opens bookmarked file</td>
</tr>

<tr>
<td class="left">M-x narrow-to-region</td>
<td class="left">narrows to current selection</td>
</tr>

<tr>
<td class="left">M-x widen</td>
<td class="left">widens to full buffer</td>
</tr>

<tr>
<td class="left">M-x align-regexp</td>
<td class="left">align region around regexp</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left"><b>SEARCH</b></td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">C-s</td>
<td class="left">forward search</td>
</tr>

<tr>
<td class="left">C-r</td>
<td class="left">reverse search</td>
</tr>

<tr>
<td class="left">C-s C-s</td>
<td class="left">forward search with previous term</td>
</tr>

<tr>
<td class="left">C-r C-r</td>
<td class="left">reverse search with previous term</td>
</tr>

<tr>
<td class="left">C-g</td>
<td class="left">exits search and returns to orig location</td>
</tr>

<tr>
<td class="left">ret</td>
<td class="left">selects match and drops mark at previous location</td>
</tr>

<tr>
<td class="left">C-w</td>
<td class="left">add word at point to search string</td>
</tr>

<tr>
<td class="left">C-y</td>
<td class="left">yank from clipboard to search string</td>
</tr>

<tr>
<td class="left">M-x occur</td>
<td class="left">find all</td>
</tr>

<tr>
<td class="left">M-x imenu</td>
<td class="left">jump to definition</td>
</tr>

<tr>
<td class="left">M-%</td>
<td class="left">interactive search and replace</td>
</tr>

<tr>
<td class="left">M-x replace-string</td>
<td class="left">search and replace</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left"><b>MARK</b></td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">C-M-&lt;spc&gt;</td>
<td class="left">mark by sexp</td>
</tr>

<tr>
<td class="left">M-@</td>
<td class="left">mark by word</td>
</tr>

<tr>
<td class="left">C-x h</td>
<td class="left">mark whole buffer</td>
</tr>

<tr>
<td class="left">C-u C-&lt;spc&gt;</td>
<td class="left">return to mark</td>
</tr>

<tr>
<td class="left">C-&lt;spc&gt;</td>
<td class="left">set mark toggles region</td>
</tr>

<tr>
<td class="left">C-k</td>
<td class="left">kill rest of line</td>
</tr>

<tr>
<td class="left">C-S-&lt;backspace&gt;</td>
<td class="left">kill line</td>
</tr>

<tr>
<td class="left">M-d, C-&lt;backspace&gt;</td>
<td class="left">kill word</td>
</tr>

<tr>
<td class="left">C-w</td>
<td class="left">kill region</td>
</tr>

<tr>
<td class="left">M-w</td>
<td class="left">copy to kill ring</td>
</tr>

<tr>
<td class="left">C-y</td>
<td class="left">yank</td>
</tr>

<tr>
<td class="left">M-y</td>
<td class="left">cycle through kill ring</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left"><b>ORG TABLE</b></td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&vert;-</td>
<td class="left">create horizontal line</td>
</tr>

<tr>
<td class="left">&vert;</td>
<td class="left">start a row</td>
</tr>

<tr>
<td class="left">C-c ^</td>
<td class="left">sort rows by column where point is</td>
</tr>

<tr>
<td class="left">C-c -</td>
<td class="left">insert horizontal line</td>
</tr>

<tr>
<td class="left">M-S-&lt;down&gt;</td>
<td class="left">insert row</td>
</tr>

<tr>
<td class="left">M-S-&lt;up&gt;</td>
<td class="left">kill current row</td>
</tr>

<tr>
<td class="left">M-&lt;up&gt;</td>
<td class="left">move row up (down)</td>
</tr>

<tr>
<td class="left">M-S-&lt;right&gt;</td>
<td class="left">insert column</td>
</tr>

<tr>
<td class="left">M-S-&lt;left&gt;</td>
<td class="left">kill current column</td>
</tr>

<tr>
<td class="left">M-&lt;left&gt;</td>
<td class="left">move column left (right)</td>
</tr>

<tr>
<td class="left">C-c =</td>
<td class="left">add formula</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left"><b>ORG GENERAL</b></td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">\*</td>
<td class="left">start heading</td>
</tr>

<tr>
<td class="left">&lt;tab&gt;</td>
<td class="left">show/hide heading</td>
</tr>

<tr>
<td class="left">C-c C-n</td>
<td class="left">next heading</td>
</tr>

<tr>
<td class="left">C-c C-p</td>
<td class="left">previous heading</td>
</tr>

<tr>
<td class="left">\+ &#x00ad; \*</td>
<td class="left">plain list item</td>
</tr>

<tr>
<td class="left">[ ]</td>
<td class="left">checkbox</td>
</tr>

<tr>
<td class="left">C-c !</td>
<td class="left">add date</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left"><b>ORG TODO</b></td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">C-c C-t</td>
<td class="left">cycle TODO item through states</td>
</tr>

<tr>
<td class="left">C-c C-s</td>
<td class="left">schedule a TODO</td>
</tr>

<tr>
<td class="left">C-c C-d</td>
<td class="left">insert a deadline</td>
</tr>

<tr>
<td class="left">C-c C-z</td>
<td class="left">add a note</td>
</tr>

<tr>
<td class="left">M-S-&lt;return&gt;</td>
<td class="left">add a TODO at same indentation</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left"><b>ORG AGENDA VIEW</b></td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">d</td>
<td class="left">daily view</td>
</tr>

<tr>
<td class="left">t</td>
<td class="left">cycle TODO item through states</td>
</tr>

<tr>
<td class="left">s</td>
<td class="left">save all connected org files</td>
</tr>

<tr>
<td class="left">r</td>
<td class="left">reload view</td>
</tr>

<tr>
<td class="left">&lt;tab&gt;</td>
<td class="left">go to original item</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left"><b>ARTIST MODE</b></td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">C-c C-a C-o</td>
<td class="left">select drawing tool</td>
</tr>

<tr>
<td class="left">&lt;return&gt;</td>
<td class="left">starts and stops lines and rect, dir on poly line</td>
</tr>

<tr>
<td class="left">C-u &lt;return&gt;</td>
<td class="left">stops poly line</td>
</tr>

<tr>
<td class="left">&lt; &gt;</td>
<td class="left">adds/removes arrows of last line drawn</td>
</tr>
</tbody>
</table>
</div>
</body>
</html>
